simulationCase/HagenPoiseuilleFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-6;

vertices
(
    (0  0  0)
    (100 0  0)
    (100 48 0)
    (0  48 0)
    (0  0  20)
    (100 0  20)
    (100 48 20)
    (0  48 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 24 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
	        (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type wall;
        faces
        (
             (4 5 6 7)
        );
    }
    frontAndBack
    {
        type symmetry;
        faces
        (
	        (1 5 4 0)
            (3 7 6 2)
        );
    }
//    back
//    {
//        type wall;
//        faces
//        (
//            (3 7 6 2)
//        );
//    }
);

// ************************************************************************* //
