simulationCase/HagenPoiseuilleFlow/constant/dynamicMeshDict.bk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// How often to refine
refineInterval  1000;

// Field to be refinement on
field           alpha.liquid;

// Refine field inbetween lower..upper
lowerRefineLevel 0.1;
upperRefineLevel 0.9;

// If value < unrefineLevel unrefine
unrefineLevel   0;

// Have slower than 2:1 refinement
nBufferLayers   2;

// Refine cells only up to maxRefinement levels
maxRefinement   2;

// Stop refinement if maxCells reached
maxCells        20000000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (phi.solid none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi.liquid none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
    (phi_0_0 none)
    (ddtCorrDdt0(phi) none)
    (alphaPhi.solid none)
    (alphaPhi0.liquid none)
    (alphaPhiUn none)
    (phi_0 none)
);

// Write the refinement level as a volScalarField
dumpLevel       false;


// ************************************************************************* //
