simulationCase/HagenPoiseuilleFlow/0.orig/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 1; 
 
boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 1;
    }
    right
    {
        type            fixedValue;
        value           uniform 1;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            symmetry;
    }
    "proc.*"
    {
        type            processor;
    }
//    back
//    {
//        type            zeroGradient;
//    }
}


// ************************************************************************* //
