simulationCase/HagenPoiseuilleFlow/0.orig/diffCo1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      diffCo1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.4E-9;

boundaryField
{
    left
    {
        type           zeroGradient;
    }
    right
    {
        type           zeroGradient;
    }
    bottom
    {
        type           zeroGradient;
    }
    top
    {
        type           zeroGradient;
    }
    frontAndBack
    {
        type           symmetry;
    }
    "proc.*"
    {
        type           processor;
    }
//    back
//    {
//        type           symmetry;
//    }
}

// ************************************************************************* //
